app/Controllers/Apps.php

SELECT *
FROM `dataset`
---
    function Samples()
    {
        $data = ['dataset' => $this->MDataset->findAll()];

SELECT *
FROM `dataset`
---
    function TableListDataset()
    {
        if ($this->request->isAJAX()) {
            $data = ['dataset' => $this->MDataset->findAll()];

SELECT *
FROM `dataset`
---
    function Predict()
    {
        $data = [
            'list_dataset' => $this->MDataset->findAll()
        ];

INSERT INTO `dataset` (`file_name`, `file`, `url`, `is_active`) VALUES ('avbaba', '1692678485_0306bc06cdb38d122898.csv', 'D:\\APP\\XAMPP\\htdocs\\bayes\\/datasets/1692678485_0306bc06cdb38d122898.csv', NULL)
---
                    'is_active' => null
                ];

                $this->MDataset->save($data);

SELECT COUNT(*) AS `numrows`
FROM `diagnosis`
WHERE `kecamatan` = 'MANGUNJAYA'
---
    public function Peta()
    {
        $kecamatanData = $this->Kecamatan->findAll(); // Data kecamatan dari tabel pertama
        $totalDiagnosis = [];

        foreach ($kecamatanData as $kecamatan) {
            $keyword = $kecamatan->kecamatan;
            $totalDiagnosis[$keyword] = $this->diagnosisModel->where('kecamatan', $keyword)->countAllResults();